ЯМБух.ЯндексМаршрутизация/src/Catalogs/ЯМ_Настройки/ЯМ_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЯМ_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ЯМ_СкладыОтгрузки</types>
      <types>CatalogRef.ЯМ_ТранспортныеСредства</types>
      <types>Boolean</types>
      <types>CatalogRef.ЯМ_Настройки</types>
      <types>String</types>
      <types>CatalogRef.ЯМ_НастройкиШтрафовДляАлгоритмов</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ЯМ_Теги</types>
      <types>EnumRef.ЯМ_СтатусыЗапросов</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЯМБух.ЯндексМаршрутизация/src/CommonModules/ЯМ_РаботаСНастройками/Module.bsl
Функция ПолучитьНастройкиМодуля() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_Настройки.Имя КАК Наименование,
	|	ЯМ_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ЯМ_Настройки КАК ЯМ_Настройки
	|ГДЕ
	|	НЕ ЯМ_Настройки.ПометкаУдаления
	|	И НЕ ЯМ_Настройки.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураНастроек = Новый Структура;
	Пока Выборка.Следующий() Цикл 
		СтруктураНастроек.Вставить(Выборка.Наименование, Выборка.Значение);	
	КонецЦикла;	
	
	Возврат СтруктураНастроек;
	
КонецФункции
